# question 1

In [737]:

import pandas as pd
import numpy as np

In [738]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [739]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [740]:
print(len(df['FlightNumber']))
type(df['FlightNumber'][0])

5

numpy.float64

In [741]:
k=10045
for i in range(0,len(df['FlightNumber'])+1):
    df['FlightNumber'][i]=int(k)
    k=k+10
    
    
print(type(k))
type(df['FlightNumber'][2])

<class 'int'>

C:\Users\admin\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

numpy.float64

### converting from float to int

In [742]:
df['FlightNumber']=df['FlightNumber'].astype(int)

In [743]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [744]:
type(df['FlightNumber'][2])  #converted succcesfully from float to int

numpy.int32

# question 2

In [745]:
tempdf=df.copy()

In [746]:
tempdf['From']='Nan'
tempdf['To']='Nan'

In [747]:
tempdf

            From_To  FlightNumber  RecentDelays              Airline From   To
0      LoNDon_paris         10045      [23, 47]               KLM(!)  Nan  Nan
1      MAdrid_miLAN         10055            []    <Air France> (12)  Nan  Nan
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )  Nan  Nan
3    Budapest_PaRis         10075          [13]       12. Air France  Nan  Nan
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"  Nan  Nan

In [748]:
for i in range(0,len(tempdf['From_To'])):
    tempdf['From'][i]=((tempdf['From_To'][i]).split('_'))[0]
    tempdf['To'][i]=((tempdf['From_To'][i]).split('_'))[1]

C:\Users\admin\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\admin\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [749]:
tempdf

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [750]:
tempdf.drop('From_To',axis=1,inplace=True)

# question 3

In [751]:
tempdf

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

### either of below 2 can be used

In [752]:
for i in range(0,len(tempdf['From'])):
    tempdf['From'][i]=(tempdf.iloc[i]['From'])[0].upper()+(tempdf.iloc[i]['From'])[1:].lower()
    tempdf['To'][i]=(tempdf.iloc[i]['To'])[0].upper()+(tempdf.iloc[i]['To'])[1:].lower()
    
tempdf

C:\Users\admin\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\admin\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [753]:
for i in range(0,len(tempdf['From'])):
    tempdf['From'][i]=(tempdf['From'][i])[0].upper()+(tempdf['From'][i])[1:].lower()
    tempdf['To'][i]=(tempdf['To'][i])[0].upper()+(tempdf['To'][i])[1:].lower()

C:\Users\admin\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\admin\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [754]:
tempdf

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

# question 4

In [755]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [756]:
df.drop(['From_To'],axis=1,inplace=True)   ##dropping from_to column

In [757]:
df['From']=tempdf['From']
df['To']=tempdf['To']            ##adding from column and to column to the original data frame

In [759]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

# question 5

In [760]:
len(df['RecentDelays'])

5

In [761]:
max=0
for i in range(0,len(df['RecentDelays'])):
    if len(df['RecentDelays'][i])>max:
        max=len(df['RecentDelays'][i])

In [679]:
max

3

In [762]:
for i in range(0,max):
    df['delay_'+str(i+1)]=np.nan

In [763]:
df

,FlightNumber,RecentDelays,Airline,From,To,delay_1,delay_2,delay_3
0,10045,"[23, 47]",KLM(!),London,Paris,NaN,NaN,NaN
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,NaN,NaN,NaN
3,10075,[13],12. Air France,Budapest,Paris,NaN,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,NaN,NaN,NaN

In [764]:
type(df['delay_1'][0])

numpy.float64

In [766]:
for i in range(0,len(df['RecentDelays'])):
    l=df['RecentDelays'][i]
    for k in range(len(l),max):
        l.append(np.nan)
    ##print(l)
    for j in range(0,max):
        df['delay_'+str(j+1)][i]=l[j]

C:\Users\admin\anaconda3\lib\site-packages\ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

In [767]:
df

,FlightNumber,RecentDelays,Airline,From,To,delay_1,delay_2,delay_3
0,10045,"[23, 47, nan]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055,"[nan, nan, nan]",<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,"[13, nan, nan]",12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"[67, 32, nan]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [768]:
df.drop('RecentDelays',axis=1)

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN

# end